In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

0.20.1

In [3]:
import numpy as np

In [4]:
n = np.random.rand(5)

In [6]:
a = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}

In [7]:
arr = [0, 1, 2, 3, 4]

In [8]:
s1 = pd.Series(arr)

In [9]:
print(s1)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [10]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
s1.index=['A', 'B', 'C', 'D', 'E']

In [12]:
s1

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [13]:
s1 = s1.drop('E')

In [14]:
s1

A    0
B    1
C    2
D    3
dtype: int64

In [15]:
s1['A'] = 2
s1

A    2
B    1
C    2
D    3
dtype: int64

In [6]:
import pandas as pd
import numpy as np
dates = pd.date_range('today', periods=6)
num_arr=np.random.randn(6, 4)
columns=['A', 'B', 'C', 'D']
df1 = pd.DataFrame(num_arr, index=dates, columns=columns)
df1

                                   A         B         C         D
2018-04-14 17:33:37.931880 -0.815858 -0.365362 -0.537575 -1.238046
2018-04-15 17:33:37.931880 -0.695837  0.497559 -0.062871 -0.812664
2018-04-16 17:33:37.931880  0.355390  1.841477 -1.587168 -0.703892
2018-04-17 17:33:37.931880 -0.229460  0.727514  0.335194 -0.392742
2018-04-18 17:33:37.931880  0.527927  1.284782  1.548825 -0.447429
2018-04-19 17:33:37.931880  0.405066  2.056302  0.218206  0.034413

In [16]:
data = {'A':['cat', 'dog', 'dog', 'snake'],
        'age':[2.5, 3, 0.5, 2], 
        'visits': [1, 3, 2, 4]
        }

labels = ['a', 'b', 'c', 'e']

df2 = pd.DataFrame(data, index=labels)
df2

       A  age  visits
a    cat  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [17]:
df2.dtypes

A          object
age       float64
visits      int64
dtype: object

In [18]:
df2.values

array([['cat', 2.5, 1],
       ['dog', 3.0, 3],
       ['dog', 0.5, 2],
       ['snake', 2.0, 4]], dtype=object)

In [19]:
df2.describe()

            age    visits
count  4.000000  4.000000
mean   2.000000  2.500000
std    1.080123  1.290994
min    0.500000  1.000000
25%    1.625000  1.750000
50%    2.250000  2.500000
75%    2.625000  3.250000
max    3.000000  4.000000

In [20]:
df2.T

          a    b    c      e
A       cat  dog  dog  snake
age     2.5    3  0.5      2
visits    1    3    2      4

In [21]:
df2.sort_values(by='age')

       A  age  visits
c    dog  0.5       2
e  snake  2.0       4
a    cat  2.5       1
b    dog  3.0       3

In [22]:
df2[1:3]

     A  age  visits
b  dog  3.0       3
c  dog  0.5       2

In [23]:
df2['age']

a    2.5
b    3.0
c    0.5
e    2.0
Name: age, dtype: float64

In [24]:
df2.age

a    2.5
b    3.0
c    0.5
e    2.0
Name: age, dtype: float64

In [25]:
df2.iloc[1:3]

     A  age  visits
b  dog  3.0       3
c  dog  0.5       2

In [27]:
df3=df2.copy()

In [28]:
df3

       A  age  visits
a    cat  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [30]:
df4 = df2
df4

       A  age  visits
a    cat  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [34]:
#df4['A']['a']  = 'mol'
df2['A']['a'] = 'lom'

/home/shiyanlou/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [35]:
df2

       A  age  visits
a    lom  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [36]:
df4

       A  age  visits
a    lom  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [38]:
df4['A']['a']  = 'mol'
df4

/home/shiyanlou/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

       A  age  visits
a    mol  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [39]:
df2

       A  age  visits
a    mol  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [40]:
df3

       A  age  visits
a    cat  2.5       1
b    dog  3.0       3
c    dog  0.5       2
e  snake  2.0       4

In [3]:
import pandas as pd
import numpy as np
string = pd.Series(['A', 'B', 'C', 'Adba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
print (string)
string.str.lower()

0       A
1       B
2       C
3    Adba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

0       a
1       b
2       c
3    adba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [4]:
#df4.fillna(value=3)
#df4 =df3.copy()
#df5 = df3.copy()
# print(df5)
# df5.dropna(how='any')

In [10]:
left = pd.DataFrame({'key':['foo1', 'foo2'], 'one':[1, 2]})
right = pd.DataFrame({'key':['foo2', 'foo3'], 'one': [1, 5]})

In [11]:
print(left)
print(right)

    key  one
0  foo1    1
1  foo2    2
    key  one
0  foo2    1
1  foo3    5

In [12]:
pd.merge(left, right, on='key')

    key  one_x  one_y
0  foo2      2      1

In [13]:
pd.merge(left, right, on='one')

  key_x  one key_y
0  foo1    1  foo2

In [15]:
##df3.to_csv('animal.csv')
##df_animal=pd.read_csv('animal.csv')
##df_animal 

#pd.read_excel('animal.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

In [18]:
dti = pd.date_range(start='2018-01-01', end='2018-12-31', freq='D')
s = pd.Series(np.random.rand(len(dti)), index=dti)
s

2018-01-01    0.408108
2018-01-02    0.188556
2018-01-03    0.221136
2018-01-04    0.015997
2018-01-05    0.617224
2018-01-06    0.953601
2018-01-07    0.958552
2018-01-08    0.583498
2018-01-09    0.424083
2018-01-10    0.293378
2018-01-11    0.088410
2018-01-12    0.062199
2018-01-13    0.589640
2018-01-14    0.741816
2018-01-15    0.757798
2018-01-16    0.491513
2018-01-17    0.672178
2018-01-18    0.951005
2018-01-19    0.539568
2018-01-20    0.015795
2018-01-21    0.314893
2018-01-22    0.674260
2018-01-23    0.498722
2018-01-24    0.443013
2018-01-25    0.622770
2018-01-26    0.730766
2018-01-27    0.664829
2018-01-28    0.747330
2018-01-29    0.716435
2018-01-30    0.959747
                ...
2018-12-02    0.833159
2018-12-03    0.082043
2018-12-04    0.458085
2018-12-05    0.291341
2018-12-06    0.570067
2018-12-07    0.145928
2018-12-08    0.740537
2018-12-09    0.323043
2018-12-10    0.007656
2018-12-11    0.984730
2018-12-12    0.505898
2018-12-13    0.931144
2018-12-14    0.596267
2018-12-15    0.407206
2018-12-16    0.172061
2018-12-17    0.817069
2018-12-18    0.676171
2018-12-19    0.841107
2018-12-20    0.404254
2018-12-21    0.199035
2018-12-22    0.812146
2018-12-23    0.996061
2018-12-24    0.228106
2018-12-25    0.129831
2018-12-26    0.072983
2018-12-27    0.945442
2018-12-28    0.466657
2018-12-29    0.827082
2018-12-30    0.640718
2018-12-31    0.312252
Freq: D, Length: 365, dtype: float64

In [19]:
s[s.index.weekday == 2].sum()

23.702275166447723

In [21]:
s.resample('M').mean()

2018-01-31    0.517577
2018-02-28    0.568085
2018-03-31    0.514417
2018-04-30    0.440384
2018-05-31    0.518942
2018-06-30    0.470452
2018-07-31    0.495403
2018-08-31    0.562525
2018-09-30    0.481620
2018-10-31    0.445729
2018-11-30    0.486428
2018-12-31    0.514428
Freq: M, dtype: float64

In [22]:
s = pd.date_range('today', periods=100, freq='s')

In [23]:
s

DatetimeIndex(['2018-04-14 19:06:28.122754', '2018-04-14 19:06:29.122754',
               '2018-04-14 19:06:30.122754', '2018-04-14 19:06:31.122754',
               '2018-04-14 19:06:32.122754', '2018-04-14 19:06:33.122754',
               '2018-04-14 19:06:34.122754', '2018-04-14 19:06:35.122754',
               '2018-04-14 19:06:36.122754', '2018-04-14 19:06:37.122754',
               '2018-04-14 19:06:38.122754', '2018-04-14 19:06:39.122754',
               '2018-04-14 19:06:40.122754', '2018-04-14 19:06:41.122754',
               '2018-04-14 19:06:42.122754', '2018-04-14 19:06:43.122754',
               '2018-04-14 19:06:44.122754', '2018-04-14 19:06:45.122754',
               '2018-04-14 19:06:46.122754', '2018-04-14 19:06:47.122754',
               '2018-04-14 19:06:48.122754', '2018-04-14 19:06:49.122754',
               '2018-04-14 19:06:50.122754', '2018-04-14 19:06:51.122754',
               '2018-04-14 19:06:52.122754', '2018-04-14 19:06:53.122754',
               '2018-04-14 19:06:54.122754', '2018-04-14 19:06:55.122754',
               '2018-04-14 19:06:56.122754', '2018-04-14 19:06:57.122754',
               '2018-04-14 19:06:58.122754', '2018-04-14 19:06:59.122754',
               '2018-04-14 19:07:00.122754', '2018-04-14 19:07:01.122754',
               '2018-04-14 19:07:02.122754', '2018-04-14 19:07:03.122754',
               '2018-04-14 19:07:04.122754', '2018-04-14 19:07:05.122754',
               '2018-04-14 19:07:06.122754', '2018-04-14 19:07:07.122754',
               '2018-04-14 19:07:08.122754', '2018-04-14 19:07:09.122754',
               '2018-04-14 19:07:10.122754', '2018-04-14 19:07:11.122754',
               '2018-04-14 19:07:12.122754', '2018-04-14 19:07:13.122754',
               '2018-04-14 19:07:14.122754', '2018-04-14 19:07:15.122754',
               '2018-04-14 19:07:16.122754', '2018-04-14 19:07:17.122754',
               '2018-04-14 19:07:18.122754', '2018-04-14 19:07:19.122754',
               '2018-04-14 19:07:20.122754', '2018-04-14 19:07:21.122754',
               '2018-04-14 19:07:22.122754', '2018-04-14 19:07:23.122754',
               '2018-04-14 19:07:24.122754', '2018-04-14 19:07:25.122754',
               '2018-04-14 19:07:26.122754', '2018-04-14 19:07:27.122754',
               '2018-04-14 19:07:28.122754', '2018-04-14 19:07:29.122754',
               '2018-04-14 19:07:30.122754', '2018-04-14 19:07:31.122754',
               '2018-04-14 19:07:32.122754', '2018-04-14 19:07:33.122754',
               '2018-04-14 19:07:34.122754', '2018-04-14 19:07:35.122754',
               '2018-04-14 19:07:36.122754', '2018-04-14 19:07:37.122754',
               '2018-04-14 19:07:38.122754', '2018-04-14 19:07:39.122754',
               '2018-04-14 19:07:40.122754', '2018-04-14 19:07:41.122754',
               '2018-04-14 19:07:42.122754', '2018-04-14 19:07:43.122754',
               '2018-04-14 19:07:44.122754', '2018-04-14 19:07:45.122754',
               '2018-04-14 19:07:46.122754', '2018-04-14 19:07:47.122754',
               '2018-04-14 19:07:48.122754', '2018-04-14 19:07:49.122754',
               '2018-04-14 19:07:50.122754', '2018-04-14 19:07:51.122754',
               '2018-04-14 19:07:52.122754', '2018-04-14 19:07:53.122754',
               '2018-04-14 19:07:54.122754', '2018-04-14 19:07:55.122754',
               '2018-04-14 19:07:56.122754', '2018-04-14 19:07:57.122754',
               '2018-04-14 19:07:58.122754', '2018-04-14 19:07:59.122754',
               '2018-04-14 19:08:00.122754', '2018-04-14 19:08:01.122754',
               '2018-04-14 19:08:02.122754', '2018-04-14 19:08:03.122754',
               '2018-04-14 19:08:04.122754', '2018-04-14 19:08:05.122754',
               '2018-04-14 19:08:06.122754', '2018-04-14 19:08:07.122754'],
              dtype='datetime64[ns]', freq='S')

In [24]:
ts = pd.Series(np.random.randint(0, 500, len(s)), index=s)

In [25]:
ts.resample('Min').sum()

2018-04-14 19:06:00     7189
2018-04-14 19:07:00    15417
2018-04-14 19:08:00     2221
Freq: T, dtype: int64

In [26]:
s = pd.date_range('today', periods=1, freq='D')
ts = pd.Series(np.random.randn(len(s)), s)

In [29]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2018-04-14 19:08:06.922431+00:00    0.153798
Freq: D, dtype: float64

In [30]:
ts_utc.tz_convert('Asia/Shanghai')

2018-04-15 03:08:06.922431+08:00    0.153798
Freq: D, dtype: float64

In [31]:
rng = pd.date_range('1/1/2018', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
print(ts)

ps = ts.to_period()
print(ps)

ps.to_timestamp()

2018-01-31   -1.908993
2018-02-28    0.081491
2018-03-31   -1.058432
2018-04-30   -0.411951
2018-05-31    1.412383
Freq: M, dtype: float64
2018-01   -1.908993
2018-02    0.081491
2018-03   -1.058432
2018-04   -0.411951
2018-05    1.412383
Freq: M, dtype: float64

2018-01-01   -1.908993
2018-02-01    0.081491
2018-03-01   -1.058432
2018-04-01   -0.411951
2018-05-01    1.412383
Freq: MS, dtype: float64

In [33]:
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)

In [34]:
s

A  0    0.728578
   1    0.785804
   2    0.977118
   3    0.552135
   4    0.630203
   5    0.466273
   6    0.626649
   7    0.483152
   8    0.315712
   9    0.004454
B  0    0.304728
   1    0.105924
   2    0.667943
   3    0.025199
   4    0.641487
   5    0.103019
   6    0.815466
   7    0.919858
   8    0.928132
   9    0.561848
C  0    0.653571
   1    0.613636
   2    0.332341
   3    0.677657
   4    0.712460
   5    0.580238
   6    0.352700
   7    0.732423
   8    0.531252
   9    0.379547
dtype: float64

In [35]:
s.loc[:, [1, 3, 6]]

A  1    0.785804
   3    0.552135
   6    0.626649
B  1    0.105924
   3    0.025199
   6    0.815466
C  1    0.613636
   3    0.677657
   6    0.352700
dtype: float64

In [36]:
s.loc[pd.IndexSlice[:'B', 5:]]

A  5    0.466273
   6    0.626649
   7    0.483152
   8    0.315712
   9    0.004454
B  5    0.103019
   6    0.815466
   7    0.919858
   8    0.928132
   9    0.561848
dtype: float64

In [43]:
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape(6, 2), 
                    index=[list('AAABBB'), list('123123')], 
                    columns=['hello', 'shiyanlou'])
frame

     hello  shiyanlou
A 1      0          1
  2      2          3
  3      4          5
B 1      6          7
  2      8          9
  3     10         11

In [44]:
frame.index.names = ['first', 'second']

In [45]:
frame.groupby('first').sum()

       hello  shiyanlou
first
A          6          9
B         24         27

In [48]:
frame.groupby('second').sum()

        hello  shiyanlou
second
1           6          8
2          10         12
3          14         16

In [49]:
# frame.index.names = ['first', 'second']

In [50]:
#frame.groupby('first').sum()

In [51]:
# frame.stack()
# frame.unstack()

# df[df['age']> 3]

In [52]:
# df.iloc[2:4, 1:3]

In [53]:
# df = pd.DataFramed
# df[(df['animal'] == 'cat' ) & (df['age'] < 3)]